{
  "name": "Anna Elise Johnson",
  "titles": [
    "Artist based in Los Angeles, California"
  ],
  "website": "annaelisejohnson.com",
  "email": "annaelisejohnson@gmail.com",
  "location": "Los Angeles, California",
  "contactIntro": "Please send me a message if you would like to know more about me or my artwork.",
  "resumeLink": "https://annaelisejohnson.com/AnnaEliseJohnsonCV2024.pdf",
  "socialLinks": [
    {
      "name": "instagram",
      "handle": "annaelise_art",
      "url": "https://instagram.com/annaelise_art"
    }
  ],
  "abouts": [
    "Anna Elise Johnson is a contemporary artist based in Los Angeles, California. Born in Starnberg, Germany, and raised in Colorado Springs, Colorado, Anna Elise's artistic journey was shaped from an early age by her father, the renowned painter Roger Hayden Johnson, who guided her artistic growth from an early age. She went on to earn her BFA in Painting and Printmaking from Washington University in St. Louis.",
    "After completing her degree, Anna Elise moved to Berlin, where she worked as an assistant to the celebrated artist Julie Mehretu. During her time with Mehretu, she assisted in major projects  for the Deutsche Guggenheim exhibition and worked on the monumental painting “Mural” for Goldman Sachs in New York City.",
    "Seeking further artistic development, Anna Elise returned to the U.S. to pursue an MFA at the University of Chicago, where she studied with notable artists including William Pope.L, Laura Letinsky, and Geof Oppenheimer. Her academic and studio practice flourished during this time, strengthening her conceptual and technical approach.",
    "Following graduate school, Anna Elise was awarded a prestigious Core Fellowship at the Glassell School of Art in Houston, Texas, where she further refined her work. Over the years, her art has been featured in more than twenty group exhibitions across the United States and abroad, including shows in India at the University of Chicago's Delhi Center, in Slovenia, and multiple exhibitions in Germany. She has also held solo exhibitions in Chicago, Berlin, Dallas, Denver, and at the Blaffer Museum in Houston.",
    "Anna Elise Johnson's work interrogates how images shape our understanding of ideology, politics, and our understanding of the landscape. She uses multiple techniques to layer and juxtapose images from different places and times in order to disrupt how we see images. In her recent work she explores how art has historically reinforced the divide between nature and culture. Her practice seeks to unravel these constructed boundaries, proposing that art can offer a means of reimagining our relationship to the world, its complex histories, and our place in the Anthropocene."
  ]
}