[
  {
    "company": "WebEquate",
    "role": "Founder & Full Stack Developer",
    "city": "Denver, CO",
    "startDate": "Aug 2022",
    "endDate": "Present",
    "achievements": [
      "Rebuilding websites previously built with PHP, MySQL, and Bootstrap, instead using Next.js, React, JavaScript / TypeScript, MongoDB, Tailwind, and Vercel, to modernize development workflow, streamline site updates, and enhance site speed."
    ],
    "order": 17
  },
  {
    "company": "Etsy",
    "role": "Software Engineer (Contract)",
    "city": "Brooklyn, NY (Fully remote from Denver, CO)",
    "startDate": "July 2021",
    "endDate": "July 2022",
    "achievements": [
      "Provided and maintained tools, infrastructure, and documentation to enable Etsy product teams to use modern front end development practices.",
      "Supported Mobius, a framework which allows development of interactive server side rendered (SSR) React component islands, able to inter-communicate once hydrated using a shared Redux store (Redux Toolkit), while still maintaining site speed for shoppers and search engines.",
      "Participated in replacement of Underscore library with native JavaScript / TypeScript, and in transition from Smarty templates to Mustache, in the interest of a more consistent developer experience and improved site performance."
    ],
    "order": 16
  },
  {
    "company": "DISH Network",
    "role": "Front End Software Developer (Contract)",
    "city": "Englewood, CO",
    "startDate": "Jun 2019",
    "endDate": "Mar 2020",
    "achievements": [
      "Developed in JavaScript, primarily using React and Redux, for OnTech Smart Services, an e-commerce site focused on selling smart home devices and expert installation.",
      "Developed user interface features, both customer-facing and internal, often integrating with back end RESTful APIs, on a cross-functional, full stack Scrum team.",
      "Improved Where’s My Tech, a Shopify app with a Ruby on Rails codebase, using corporate APIs to dynamically update a map showing technician location, van direction, and route details."
    ],
    "order": 15
  },
  {
    "company": "WebEquate",
    "role": "Founder & Full Stack Developer",
    "city": "Denver, CO",
    "startDate": "Mar 2018",
    "endDate": "July 2021",
    "achievements": [
      "Developed, maintain, and update RogerHaydenJohnson.com, the official artist website, using PHP 7 and MySQL, upgraded with a mobile first responsive design.",
      "Built the Allen’s Aliens social media marketing campaign, incorporating swag giveaways at events, glossy double-sided business cards, Instagram profile, Facebook page, and a responsive website."
    ],
    "order": 14
  },
  {
    "company": "JackRabbit (formerly Running Specialty Group)",
    "role": "E-Commerce Front End Developer",
    "city": "Denver, CO",
    "startDate": "Sep 2015",
    "endDate": "Feb 2018",
    "achievements": [
      "Performed front end development in a Magento e-commerce environment.",
      "Developed responsive landing pages, CMS templates, and user experience enhancements using HTML, Sass, Bootstrap, CSS media queries, and custom JavaScript and jQuery.",
      "Integrated paid advertising platforms, installed numerous third-party tracking pixels, and configured dynamic product feed delivery."
    ],
    "order": 13
  },
  {
    "company": "Gates Corporation",
    "role": "Lead Front End Developer (Contract)",
    "city": "Denver, CO",
    "startDate": "Jan 2015",
    "endDate": "Mar 2015",
    "achievements": [
      "Early design and development of a web application built with AngularJS for equipment tracking on tablet and desktop."
    ],
    "order": 12
  },
  {
    "company": "Oppenheimer Funds",
    "role": "Front End Developer (Contract)",
    "city": "Centennial, CO",
    "startDate": "May 2014",
    "endDate": "Nov 2014",
    "achievements": [
      "Implemented feature enhancements and design upgrades to the company's financial advisor website, built in Ruby on Rails, as a front-end focused member of an Agile team working with AngularJS."
    ],
    "order": 11
  },
  {
    "company": "Commerce Kitchen",
    "role": "Senior Web Engineer",
    "city": "Denver, CO",
    "startDate": "May 2013",
    "endDate": "Nov 2013",
    "achievements": [
      "Developed and themed online stores on the Magento e-commerce platform, acted as ScrumMaster for two small development teams, and learned Ruby on Rails development."
    ],
    "order": 10
  },
  {
    "company": "Experian",
    "role": "Web Developer (Contract)",
    "city": "Denver, CO",
    "startDate": "Dec 2012",
    "endDate": "May 2013",
    "achievements": [
      "Front end development for Experian’s UK credit monitoring and identity theft protection sites."
    ],
    "order": 9
  },
  {
    "company": "Intela",
    "role": "UI Developer / ScrumMaster",
    "city": "Boulder, CO",
    "startDate": "Mar 2010",
    "endDate": "Dec 2012",
    "achievements": [
      "Lead UI developer and ScrumMaster for a 7 member UI team, focused on building online properties to generate leads for advertisers in 9 international markets.",
      "Built landing pages from Photoshop designs, and developed a JavaScript / jQuery code library to integrate a new RESTful API for lead validation using internal and third-party services.",
      "Conducted daily standups and bi-weekly retrospectives, interfaced with product owner, project managers, and back end team, and coordinated twice weekly code releases."
    ],
    "order": 8
  },
  {
    "company": "Numeric Analytics",
    "role": "Independent Contractor",
    "city": "Golden, CO",
    "startDate": "Dec 2009",
    "endDate": "Mar 2010",
    "achievements": [
      "Implemented custom web analytics and tracking solutions for client companies using a vanilla JavaScript framework built to integrate with Omniture."
    ],
    "order": 7
  },
  {
    "company": "Highmark",
    "role": "Web Developer (Contract)",
    "city": "Pittsburgh, PA",
    "startDate": "May 2009",
    "endDate": "Dec 2009",
    "achievements": [
      "Modified Highmark’s health insurance websites to meet Section 508 accessibility standards.",
      "Overhauled HTML, CSS, and JavaScript to better separate content, presentation, and behavior."
    ],
    "order": 6
  },
  {
    "company": "Fireman Creative",
    "role": "Senior Web Developer",
    "city": "Pittsburgh, PA",
    "startDate": "July 2007",
    "endDate": "May 2009",
    "achievements": [
      "Developed and maintained a wide range of dynamic, database-driven client websites using PHP and MySQL.",
      "Handled search engine optimization (SEO), pay-per-click (PPC) advertising with AdWords, user tracking and analysis with Google Analytics, and affiliate marketing using LinkShare.",
      "Implemented a social networking and viral marketing strategy for a regional tourism office, incorporating Facebook, Twitter, YouTube, Flickr, and a WordPress blog."
    ],
    "order": 5
  },
  {
    "company": "RJ Lee Group",
    "role": "Software Engineer",
    "city": "Pittsburgh, PA",
    "startDate": "Aug 2006",
    "endDate": "July 2007",
    "achievements": [
      "Developed laboratory management software using Java, Visual Basic .NET, C#, and ActionScript.",
      "Maintained the corporate website using PHP, HTML, CSS, Flash, and Photoshop."
    ],
    "order": 4
  },
  {
    "company": "WebEquate",
    "role": "Founder & Web Developer",
    "city": "Pittsburgh, PA",
    "startDate": "July 2004",
    "endDate": "Aug 2006",
    "achievements": [
      "Designed and developed dynamic database-driven client websites using PHP and MySQL."
    ],
    "order": 3
  },
  {
    "company": "The Titan Corporation",
    "role": "Scientific Programmer",
    "city": "San Diego, CA",
    "startDate": "Aug 2002",
    "endDate": "June 2004",
    "achievements": [
      "Developed software tools to model systems in nuclear and natural radiation using Java and JSP."
    ],
    "order": 2
  },
  {
    "company": "Carnegie Learning",
    "role": "Software Developer",
    "city": "Pittsburgh, PA",
    "startDate": "July 2000",
    "endDate": "Oct 2001",
    "achievements": [
      "Designed and implemented intelligent cognitive tutoring software using Java and Lisp."
    ],
    "order": 1
  }
]
